vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EZR32HG_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>EZR32HG_DFP</name>
  <description>Silicon Labs EZR32 Happy Gecko Series Device Support</description>

  <releases>
    <release version="1.2.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EZR32HG_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EZR32HG_DFP.
    </release>
    <release version="1.1.0" date="2017-06-22">
      Updated device support files to V5.1.3.
      Updated Flash Algorithms to V5.2.0.
      Updated SVD files to V5.2.1.
      Updated emlib, emdrv to V5.1.3.
      Updated documentation.
    </release>
    <release version="1.0.0" date="2016-04-22">
      Initial Release version of EZR32HG Device Family Pack.
      device support files to V4.2.1.
      emlib, emdrv to V4.2.1.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EZR32HG</keyword>
    <keyword>EZR32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EZR32HG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <processor Dclock="24000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <book name="Documents/EZR32HG-RM.pdf"                    title="EZR32HG Reference Manual"/>

      <description>
The EZR32HG Wireless MCU family delivers a high performance, low-energy wireless solution integrated into a small form factor package.
By combining a high performance sub-GHz RF transceiver with an energy efficient 32-bit MCU, the EZR32HG family provides designers the ultimate in flexibility with a family of pin-compatible devices that scale with 64/32 kB of flash and support Silicon Labs EZRadio® or EZRadioPRO® transceivers.
The ultra-low power operating modes and fast wake-up times of the Silicon Labs energy friendly 32-bit MCUs, combined with the low transmit and receive power consumption of the sub-GHz radio, result in a solution optimized for battery powered applications.
      </description>

      <!-- ************************  Subfamily 'EZR32HG220'  **************************** -->
      <subFamily DsubFamily="EZR32HG220">
        <book name="Documents/EZR32HG220-DataSheet.pdf" title="EZR32HG220 Data Sheet"/>

        <!-- *************************  Device 'EZR32HG220F32R55'  ***************************** -->
        <device Dname="EZR32HG220F32R55">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R55"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R55.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R55'  ***************************** -->
        <device Dname="EZR32HG220F64R55">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R55"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R55.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F32R60'  ***************************** -->
        <device Dname="EZR32HG220F32R60">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R60"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R60.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R60'  ***************************** -->
        <device Dname="EZR32HG220F64R60">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R60"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R60.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F32R61'  ***************************** -->
        <device Dname="EZR32HG220F32R61">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R61"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R61.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F64R61'  ***************************** -->
        <device Dname="EZR32HG220F64R61">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F64R61"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F64R61.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00010000" startup="1"   default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0"   default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00010000"               default="1"/>
        </device>

        <!-- *************************  Device 'EZR32HG220F32R63'  ***************************** -->
        <device Dname="EZR32HG220F32R63">
          <compile header="Device/EZR32HG/Include/em_device.h"  define="EZR32HG220F32R63"/>
          <debug svd="SVD/EZR32HG/EZR32HG220F32R63.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32M0P.FLM" start="0x00000000" size="0x00008000"             default="1"/>
        </device>

